/*Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа.
456 -> 46
782 -> 72
918 -> 98
*/
int number = 456;
var str = number.ToString();

number = int.Parse(str.Remove(str.Length - 2, 1));
Console.WriteLine($"Рандомное число: {number}");