/*Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6
*/

Console.WriteLine("Введите число");
    int firstNumber =  Convert.ToInt32(Console.ReadLine());
    string firstNumberStr = Convert.ToString(firstNumber);
if (firstNumberStr.Length > 2)
{
  Console.WriteLine("третья цифра " + firstNumberStr[2]);
}
else {
  Console.WriteLine("третьей цифры нет");
}